garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD1PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD1PPS0" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS1" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS2" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS3" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS4" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS5" edc:mask="0x1" edc:name="RD1PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS6" edc:mask="0x1" edc:name="RD1PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD2PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD2PPS0" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS1" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS2" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS3" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS4" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS5" edc:mask="0x1" edc:name="RD2PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS6" edc:mask="0x1" edc:name="RD2PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD3PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD3PPS0" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS1" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS2" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS3" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS4" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS5" edc:mask="0x1" edc:name="RD3PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS6" edc:mask="0x1" edc:name="RD3PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD4PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD4PPS0" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS1" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS2" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS3" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS4" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS5" edc:mask="0x1" edc:name="RD4PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS6" edc:mask="0x1" edc:name="RD4PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD5PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD5PPS0" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS1" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS2" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS3" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS4" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS5" edc:mask="0x1" edc:name="RD5PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS6" edc:mask="0x1" edc:name="RD5PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD6PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD6PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD6PPS0" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS1" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS2" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS3" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS4" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS5" edc:mask="0x1" edc:name="RD6PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS6" edc:mask="0x1" edc:name="RD6PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RD7PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RD7PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x220">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD7PPS0" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS1" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS2" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS3" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS4" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS5" edc:mask="0x1" edc:name="RD7PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS6" edc:mask="0x1" edc:name="RD7PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RE0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RE0PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x221">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0PPS0" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS1" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS2" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS3" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS4" edc:mask="0x1" edc:name="RE0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS5" edc:mask="0x1" edc:name="RE0PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS6" edc:mask="0x1" edc:name="RE0PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RE1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RE1PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x222">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE1PPS0" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS1" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS2" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS3" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS4" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS5" edc:mask="0x1" edc:name="RE1PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS6" edc:mask="0x1" edc:name="RE1PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RE2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RE2PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x223">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE2PPS0" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS1" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS2" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS3" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS4" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS5" edc:mask="0x1" edc:name="RE2PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS6" edc:mask="0x1" edc:name="RE2PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x5" edc:_addr="0x224"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF0PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x229">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0PPS0" edc:mask="0x1" edc:name="RF0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF0PPS1" edc:mask="0x1" edc:name="RF0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF0PPS2" edc:mask="0x1" edc:name="RF0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF0PPS3" edc:mask="0x1" edc:name="RF0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF0PPS4" edc:mask="0x1" edc:name="RF0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF0PPS5" edc:mask="0x1" edc:name="RF0PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF0PPS6" edc:mask="0x1" edc:name="RF0PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
