garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U1CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U1CTSPPS" edc:nzwidth="8" edc:por="--010110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x273">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1CTSPPS" edc:mask="0x3f" edc:name="U1CTSPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1CTSPPS0" edc:mask="0x1" edc:name="U1CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS1" edc:mask="0x1" edc:name="U1CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS2" edc:mask="0x1" edc:name="U1CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS3" edc:mask="0x1" edc:name="U1CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS4" edc:mask="0x1" edc:name="U1CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS5" edc:mask="0x1" edc:name="U1CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U2RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U2RXPPS" edc:nzwidth="8" edc:por="---01111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x274">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXPPS" edc:mask="0x1f" edc:name="U2RXPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2RXPPS0" edc:mask="0x1" edc:name="U2RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS1" edc:mask="0x1" edc:name="U2RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS2" edc:mask="0x1" edc:name="U2RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS3" edc:mask="0x1" edc:name="U2RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS4" edc:mask="0x1" edc:name="U2RXPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U2CTSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U2CTSPPS" edc:nzwidth="8" edc:por="---01110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x275">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2CTSPPS" edc:mask="0x1f" edc:name="U2CTSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2CTSPPS0" edc:mask="0x1" edc:name="U2CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS1" edc:mask="0x1" edc:name="U2CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS2" edc:mask="0x1" edc:name="U2CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS3" edc:mask="0x1" edc:name="U2CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS4" edc:mask="0x1" edc:name="U2CTSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U3RXPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U3RXPPS" edc:nzwidth="8" edc:por="--000111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x276">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3RXPPS" edc:mask="0x3f" edc:name="U3RXPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U3RXPPS0" edc:mask="0x1" edc:name="U3RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS1" edc:mask="0x1" edc:name="U3RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS2" edc:mask="0x1" edc:name="U3RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS3" edc:mask="0x1" edc:name="U3RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS4" edc:mask="0x1" edc:name="U3RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS5" edc:mask="0x1" edc:name="U3RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
