garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC3I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC3I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x287">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RB2I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RB2I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x288">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RB1I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RB1I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x289">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
