garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T2CLKCON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="T2CLKCON" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x326">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T2CLK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0x3f" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS5" edc:mask="0x1" edc:name="CS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2CS" edc:mask="0x3f" edc:name="T2CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2CS0" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS1" edc:mask="0x1" edc:name="T2CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS2" edc:mask="0x1" edc:name="T2CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS3" edc:mask="0x1" edc:name="T2CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS4" edc:mask="0x1" edc:name="T2CS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS5" edc:mask="0x1" edc:name="T2CS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T2RST" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T2RST" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x327">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x7f" edc:name="RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL5" edc:mask="0x1" edc:name="RSEL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL6" edc:mask="0x1" edc:name="RSEL6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2RSEL" edc:mask="0x7f" edc:name="T2RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2RSEL0" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL1" edc:mask="0x1" edc:name="T2RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL2" edc:mask="0x1" edc:name="T2RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL3" edc:mask="0x1" edc:name="T2RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL4" edc:mask="0x1" edc:name="T2RSEL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL5" edc:mask="0x1" edc:name="T2RSEL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL6" edc:mask="0x1" edc:name="T2RSEL6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="Joined 16-bit Timer" edc:name="TMR3" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x328"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x328">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3L" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR3L0" edc:mask="0x1" edc:name="TMR3L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L1" edc:mask="0x1" edc:name="TMR3L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L2" edc:mask="0x1" edc:name="TMR3L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L3" edc:mask="0x1" edc:name="TMR3L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L4" edc:mask="0x1" edc:name="TMR3L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L5" edc:mask="0x1" edc:name="TMR3L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L6" edc:mask="0x1" edc:name="TMR3L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L7" edc:mask="0x1" edc:name="TMR3L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR30" edc:mask="0x1" edc:name="TMR30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR31" edc:mask="0x1" edc:name="TMR31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR32" edc:mask="0x1" edc:name="TMR32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR33" edc:mask="0x1" edc:name="TMR33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR34" edc:mask="0x1" edc:name="TMR34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR35" edc:mask="0x1" edc:name="TMR35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR36" edc:mask="0x1" edc:name="TMR36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR37" edc:mask="0x1" edc:name="TMR37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
