garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4RST" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4RST" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x333">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x7f" edc:name="RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL5" edc:mask="0x1" edc:name="RSEL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL6" edc:mask="0x1" edc:name="RSEL6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4RSEL" edc:mask="0x7f" edc:name="T4RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4RSEL0" edc:mask="0x1" edc:name="T4RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL1" edc:mask="0x1" edc:name="T4RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL2" edc:mask="0x1" edc:name="T4RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL3" edc:mask="0x1" edc:name="T4RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL4" edc:mask="0x1" edc:name="T4RSEL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL5" edc:mask="0x1" edc:name="T4RSEL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL6" edc:mask="0x1" edc:name="T4RSEL6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR5" edc:desc="Joined 16-bit Timer" edc:name="TMR5" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x334"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR5L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x334">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5L" edc:mask="0xff" edc:name="TMR5L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR5L0" edc:mask="0x1" edc:name="TMR5L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L1" edc:mask="0x1" edc:name="TMR5L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L2" edc:mask="0x1" edc:name="TMR5L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L3" edc:mask="0x1" edc:name="TMR5L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L4" edc:mask="0x1" edc:name="TMR5L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L5" edc:mask="0x1" edc:name="TMR5L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L6" edc:mask="0x1" edc:name="TMR5L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L7" edc:mask="0x1" edc:name="TMR5L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR50" edc:mask="0x1" edc:name="TMR50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR51" edc:mask="0x1" edc:name="TMR51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR52" edc:mask="0x1" edc:name="TMR52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR53" edc:mask="0x1" edc:name="TMR53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR54" edc:mask="0x1" edc:name="TMR54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR55" edc:mask="0x1" edc:name="TMR55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR56" edc:mask="0x1" edc:name="TMR56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR57" edc:mask="0x1" edc:name="TMR57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR5H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x335">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5H" edc:mask="0xff" edc:name="TMR5H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR5H0" edc:mask="0x1" edc:name="TMR5H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H1" edc:mask="0x1" edc:name="TMR5H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H2" edc:mask="0x1" edc:name="TMR5H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H3" edc:mask="0x1" edc:name="TMR5H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H4" edc:mask="0x1" edc:name="TMR5H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H5" edc:mask="0x1" edc:name="TMR5H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H6" edc:mask="0x1" edc:name="TMR5H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H7" edc:mask="0x1" edc:name="TMR5H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR58" edc:mask="0x1" edc:name="TMR58" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR59" edc:mask="0x1" edc:name="TMR59" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR510" edc:mask="0x1" edc:name="TMR510" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR511" edc:mask="0x1" edc:name="TMR511" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR512" edc:mask="0x1" edc:name="TMR512" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR513" edc:mask="0x1" edc:name="TMR513" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR514" edc:mask="0x1" edc:name="TMR514" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR515" edc:mask="0x1" edc:name="TMR515" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="T5CON" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-u0u" edc:name="T5CON" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x336">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOT_SYNC" edc:desc="" edc:mask="0x1" edc:name="NOT_SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x3" edc:name="CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR5ON" edc:mask="0x1" edc:name="TMR5ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5RD16" edc:mask="0x1" edc:name="T5RD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_T5SYNC" edc:mask="0x1" edc:name="NOT_T5SYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS0" edc:desc="" edc:mask="0x1" edc:name="T5CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS1" edc:desc="" edc:mask="0x1" edc:name="T5CKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nSYNC" edc:mask="0x1" edc:name="nSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RD165" edc:desc="" edc:mask="0x1" edc:name="RD165" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nT5SYNC" edc:mask="0x1" edc:name="nT5SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnr--" edc:cname="T5GCON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuux--" edc:name="T5GCON" edc:nzwidth="8" edc:por="00000x--" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x337">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5GCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GVAL" edc:desc="" edc:mask="0x1" edc:name="GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GGO" edc:desc="" edc:mask="0x1" edc:name="GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GSPM" edc:desc="" edc:mask="0x1" edc:name="GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GTM" edc:desc="" edc:mask="0x1" edc:name="GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GE" edc:desc="" edc:mask="0x1" edc:name="GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="T5GVAL" edc:mask="0x1" edc:name="T5GVAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GGO" edc:desc="" edc:mask="0x1" edc:name="T5GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GSPM" edc:mask="0x1" edc:name="T5GSPM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GTM" edc:mask="0x1" edc:name="T5GTM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPOL" edc:mask="0x1" edc:name="T5GPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GE" edc:mask="0x1" edc:name="T5GE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_DONE" edc:mask="0x1" edc:name="NOT_DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_T5DONE" edc:mask="0x1" edc:name="NOT_T5DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="GGO_nDONE" edc:mask="0x1" edc:name="GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="T5GGO_nDONE" edc:mask="0x1" edc:name="T5GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T5GATE" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T5GATE" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x338">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5GATE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GSS" edc:mask="0x3f" edc:name="GSS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GSS0" edc:mask="0x1" edc:name="GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS1" edc:mask="0x1" edc:name="GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS2" edc:mask="0x1" edc:name="GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS3" edc:mask="0x1" edc:name="GSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS4" edc:mask="0x1" edc:name="GSS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS5" edc:mask="0x1" edc:name="GSS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T5GSS0" edc:mask="0x1" edc:name="T5GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS1" edc:mask="0x1" edc:name="T5GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS2" edc:mask="0x1" edc:name="T5GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS3" edc:mask="0x1" edc:name="T5GSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS4" edc:mask="0x1" edc:name="T5GSS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS5" edc:mask="0x1" edc:name="T5GSS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
