garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCPTMRS0" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--010101" edc:name="CCPTMRS0" edc:nzwidth="8" edc:por="--010101" edc:_addr="0x34C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="C3TSEL" edc:mask="0x3" edc:name="C3TSEL" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL0" edc:mask="0x1" edc:name="C3TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL1" edc:mask="0x1" edc:name="C3TSEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x34D"/>
        <edc:JoinedSFRDef edc:cname="CRCDATA" edc:desc="" edc:name="CRCDATA" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x34F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCDATL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x34F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA0" edc:desc="" edc:mask="0x1" edc:name="DATA0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA1" edc:desc="" edc:mask="0x1" edc:name="DATA1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA2" edc:desc="" edc:mask="0x1" edc:name="DATA2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA3" edc:desc="" edc:mask="0x1" edc:name="DATA3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA4" edc:desc="" edc:mask="0x1" edc:name="DATA4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA5" edc:desc="" edc:mask="0x1" edc:name="DATA5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA6" edc:desc="" edc:mask="0x1" edc:name="DATA6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA7" edc:desc="" edc:mask="0x1" edc:name="DATA7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCDATH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x350">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA8" edc:desc="" edc:mask="0x1" edc:name="DATA8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA9" edc:desc="" edc:mask="0x1" edc:name="DATA9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA10" edc:desc="" edc:mask="0x1" edc:name="DATA10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA11" edc:desc="" edc:mask="0x1" edc:name="DATA11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA12" edc:desc="" edc:mask="0x1" edc:name="DATA12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA13" edc:desc="" edc:mask="0x1" edc:name="DATA13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA14" edc:desc="" edc:mask="0x1" edc:name="DATA14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA15" edc:desc="" edc:mask="0x1" edc:name="DATA15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCACC" edc:desc="" edc:name="CRCACC" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x351">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x351">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC0" edc:desc="" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:desc="" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:desc="" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:desc="" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:desc="" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:desc="" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:desc="" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:desc="" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
