garyPenhook/PIC-Assembler/edc/PIC18F57Q43.PIC
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="PIR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4B5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIF" edc:mask="0x1" edc:name="I2C1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIF" edc:mask="0x1" edc:name="I2C1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IF" edc:mask="0x1" edc:name="I2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIF" edc:mask="0x1" edc:name="I2C1EIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IF" edc:mask="0x1" edc:name="CLC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIF" edc:mask="0x1" edc:name="PWM3PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IF" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu000" edc:name="PIR8" edc:nzwidth="8" edc:por="xxxxx000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4B6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIF" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IF" edc:mask="0x1" edc:name="U2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IF" edc:mask="0x1" edc:name="TMR5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIF" edc:mask="0x1" edc:name="TMR5GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IF" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIF" edc:mask="0x1" edc:name="SCANIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n-nnnn" edc:cname="PIR9" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u-uuuu" edc:name="PIR9" edc:nzwidth="8" edc:por="--x-xxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4B7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U3RXIF" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIF" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3EIF" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3IF" edc:mask="0x1" edc:name="U3IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IF" edc:mask="0x1" edc:name="CLC4IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIR10" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4B8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IF" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IF" edc:mask="0x1" edc:name="CLC5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2IF" edc:mask="0x1" edc:name="CWG2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2IF" edc:mask="0x1" edc:name="NCO2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIF" edc:mask="0x1" edc:name="DMA3SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIF" edc:mask="0x1" edc:name="DMA3DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIF" edc:mask="0x1" edc:name="DMA3ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIF" edc:mask="0x1" edc:name="DMA3AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR11" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIR11" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4B9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IF" edc:mask="0x1" edc:name="CCP3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6IF" edc:mask="0x1" edc:name="CLC6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3IF" edc:mask="0x1" edc:name="CWG3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIF" edc:mask="0x1" edc:name="DMA4SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIF" edc:mask="0x1" edc:name="DMA4DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIF" edc:mask="0x1" edc:name="DMA4ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIF" edc:mask="0x1" edc:name="DMA4AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR12" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIR12" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4BA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U4RXIF" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4TXIF" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4EIF" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4IF" edc:mask="0x1" edc:name="U4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5SCNTIF" edc:mask="0x1" edc:name="DMA5SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5DCNTIF" edc:mask="0x1" edc:name="DMA5DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5ORIF" edc:mask="0x1" edc:name="DMA5ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5AIF" edc:mask="0x1" edc:name="DMA5AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIR13" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4BB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U5RXIF" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5TXIF" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5EIF" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5IF" edc:mask="0x1" edc:name="U5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6SCNTIF" edc:mask="0x1" edc:name="DMA6SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6DCNTIF" edc:mask="0x1" edc:name="DMA6DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6ORIF" edc:mask="0x1" edc:name="DMA6ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6AIF" edc:mask="0x1" edc:name="DMA6AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnn-" edc:cname="PIR14" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuu-" edc:name="PIR14" edc:nzwidth="8" edc:por="----xxx-" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4BC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC7IF" edc:mask="0x1" edc:name="CLC7IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IF" edc:mask="0x1" edc:name="C2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3IF" edc:mask="0x1" edc:name="NCO3IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PIR15" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="PIR15" edc:nzwidth="8" edc:por="----xxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4BD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMIF" edc:mask="0x1" edc:name="NVMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IF" edc:mask="0x1" edc:name="CLC8IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIF" edc:mask="0x1" edc:name="CRCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IF" edc:mask="0x1" edc:name="TMR6IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
